/*
 Navicat Premium Dump SQL

 Source Server         : Mysqlfirst
 Source Server Type    : MySQL
 Source Server Version : 90200 (9.2.0)
 Source Host           : localhost:3306
 Source Schema         : 电影院

 Target Server Type    : MySQL
 Target Server Version : 90200 (9.2.0)
 File Encoding         : 65001

 Date: 14/08/2026 16:46:16
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for cinema
-- ----------------------------
DROP TABLE IF EXISTS `cinema`;
CREATE TABLE `cinema`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '影院ID',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '影院名称',
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '地址',
  `status` tinyint NULL DEFAULT NULL COMMENT '状态：0-停业，1-营业中',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of cinema
-- ----------------------------
INSERT INTO `cinema` VALUES (1, '万达影城', '南京', 1);
INSERT INTO `cinema` VALUES (2, '金逸影城', '徐州', 1);
INSERT INTO `cinema` VALUES (3, '一号影城', '扬州', 1);
INSERT INTO `cinema` VALUES (4, '时代影城', '苏州', 1);

-- ----------------------------
-- Table structure for hall
-- ----------------------------
DROP TABLE IF EXISTS `hall`;
CREATE TABLE `hall`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '影厅ID',
  `cinema_id` bigint NOT NULL COMMENT '所属影院ID',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '影厅名称（如：1号厅）',
  `status` tinyint NULL DEFAULT NULL COMMENT '状态：0-维修中，1-正常',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `cinema_id`(`cinema_id` ASC) USING BTREE,
  CONSTRAINT `hall_ibfk_1` FOREIGN KEY (`cinema_id`) REFERENCES `cinema` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 49 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of hall
-- ----------------------------
INSERT INTO `hall` VALUES (1, 1, '1号厅', 1);
INSERT INTO `hall` VALUES (2, 1, '2号厅', 1);
INSERT INTO `hall` VALUES (3, 1, '3号厅', 1);
INSERT INTO `hall` VALUES (4, 2, '1号厅', 1);
INSERT INTO `hall` VALUES (5, 2, '2号厅', 1);
INSERT INTO `hall` VALUES (6, 2, '3号厅', 1);
INSERT INTO `hall` VALUES (7, 3, '1号厅', 1);
INSERT INTO `hall` VALUES (8, 3, '2号厅', 1);
INSERT INTO `hall` VALUES (9, 3, '3号厅', 1);
INSERT INTO `hall` VALUES (10, 4, '1号厅', 1);
INSERT INTO `hall` VALUES (11, 4, '2号厅', 1);
INSERT INTO `hall` VALUES (12, 4, '3号厅', 1);

-- ----------------------------
-- Table structure for movie
-- ----------------------------
DROP TABLE IF EXISTS `movie`;
CREATE TABLE `movie`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '影片ID',
  `title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '影片名称',
  `original_title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '原片名',
  `director` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '导演',
  `writers` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '编剧',
  `actors` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '主演',
  `genres` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '类型（如：动作/科幻/剧情）',
  `country` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '制片国家/地区',
  `language` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '语言',
  `release_date` date NULL DEFAULT NULL COMMENT '上映日期',
  `runtime` int NULL DEFAULT NULL COMMENT '片长（分钟）',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '剧情简介',
  `rating` decimal(3, 1) NULL DEFAULT 0.0 COMMENT '评分',
  `votes` int NULL DEFAULT 0 COMMENT '评分人数',
  `box_office` decimal(15, 2) NULL DEFAULT 0.00 COMMENT '票房（万元）',
  `status` tinyint NULL DEFAULT 0 COMMENT '状态：0-未上映，1-上映中，2-已下映',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `poster_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '电影海报',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 46 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of movie
-- ----------------------------
INSERT INTO `movie` VALUES (1, '星际穿越', 'Interstellar', '克里斯托弗・诺兰', '克里斯托弗・诺兰', '马修·麦康纳', '科幻', '美国', '英语', '2014-11-05', 169, '《星际穿越》是 2014 年美英联合制作的科幻电影，由克里斯托弗・诺兰执导。影片基于物理学家基普・索恩的黑洞理论改编，讲述了在地球面临生态危机时，前 NASA 宇航员库珀带领探险队穿越虫洞，前往另一个星系寻找新家园的冒险历程。他们在不同星球经历了种种挑战，库珀还进入五维空间，通过引力将黑洞数据传递给女儿墨菲，最终人类在墨菲的帮助下离开地球，库珀则前往埃德蒙斯星球寻找同伴艾米莉亚。', 9.2, 2000000, 726000.00, 1, '2025-05-28 11:34:46', 'picture\\\\星际穿越.jpg');
INSERT INTO `movie` VALUES (2, '霸王别姬', '霸王别姬', '陈凯歌', '李碧华', '张国荣', '爱情', '中国', '中文', '1993-01-01', 171, '《霸王别姬》是1993年由陈凯歌执导的经典华语电影，改编自李碧华同名小说。影片以京剧艺人程蝶衣（张国荣 饰）和段小楼（张丰毅 饰）的人生轨迹为主线，横跨民国、抗战、文革等多个历史时期，展现了个体命运与时代洪流的激烈碰撞。\r\n程蝶衣自幼被母亲送入戏班，因性别认知错乱（儿时被迫唱 “我本是女娇娥”）而深陷角色，将京剧视为生命信仰，对段小楼的 “从一而终” 更成为其情感与艺术的双重执念。段小楼则在现实压力下逐渐妥协，从 “霸王” 沦为随波逐流的普通人。两人因师妹菊仙（巩俐 饰）的介入产生裂痕，文革中互相揭发的背叛戏码更是将人性的脆弱与时代的荒诞推向高潮。\r\n影片以京剧为魂，用细腻的镜头语言和深刻的悲剧内核，探讨了艺术与现实、性别与身份、忠诚与背叛的复杂命题。张国荣的 “不疯魔不成活” 的极致演绎成为影史经典，该片更斩获戛纳金棕榈奖等多项国际大奖，被誉为 “华语电影美学的巅峰”。', 9.4, 1455555, 500000.00, 1, '2025-05-28 14:27:57', 'picture\\\\霸王别姬.jpg');
INSERT INTO `movie` VALUES (3, '阿甘正传', 'Forrest Gump', '罗伯特·泽米斯基', '艾瑞克·罗斯', '汤姆·汉克斯', '喜剧', '美国', '英语', '1994-07-06', 142, '\r\n《阿甘正传》是1994年上映的美国经典励志电影，由罗伯特·泽米吉斯执导，汤姆·汉克斯主演。影片通过智商略低但心地单纯的主人公阿甘（汤姆·汉克斯 饰）的视角，串联起美国20世纪50至80年代的重要历史事件。他从小因腿疾戴 braces 却练成跑步健将，加入橄榄球队、参与越战并获勋章，成为乒乓球外交参与者，还因捕虾成为富翁。尽管一生经历爱情波折（如恋人珍妮的流浪与归来）、好友布巴战死等遗憾，却始终以善良和执着拥抱生活。影片用温情笔触探讨命运与选择，那句“生活就像一盒巧克力，你永远不知道下一颗是什么味道”成为经典台词，传递出对纯真心灵的赞美与生命韧性的礼赞。', 9.5, 1507000, 487303.00, 1, '2025-05-28 14:30:27', 'picture\\\\阿甘正传.jpg');
INSERT INTO `movie` VALUES (4, '泰坦尼克号', 'Titanic', '詹姆斯·卡梅隆', '詹姆斯·卡梅隆', '莱昂纳多·迪卡普里奥', '爱情', '美国', '英语', '1997-12-19', 194, '1912 年 4 月 10 日，号称 “世界工业史上的奇迹” 的豪华游轮泰坦尼克号开始首航。贵族女孩罗丝与母亲及未婚夫卡尔坐上了头等舱，画家杰克偶然得到一张下等舱船票也登上此游轮。罗丝厌倦上流社会生活，准备投海自尽时被杰克救下，两人感情升温。然而，4 月 14 日晚泰坦尼克号撞上冰山，即将沉没，杰克被卡尔陷害困在下层船舱，罗丝赶来救出了他。之后，杰克劝说罗丝上救生艇，但罗丝最终不忍心放弃杰克，又回到船上。随着船缓缓下沉，杰克带着罗丝跑到船尾，爬上栏杆，直到船只完全沉没，杰克将罗丝推上一块浮在海面的木板，自己则留在冰冷海水中，最终杰克冻死，罗丝幸运生还。', 9.4, 1339000, 153009.00, 1, '2025-05-28 14:34:19', 'picture\\\\泰坦尼克号.jpg');
INSERT INTO `movie` VALUES (5, '千与千寻', '千と千尋の神隠し', '宫崎骏', '宫崎骏', '入野自由', '动画', '日本', '日语', '2001-07-20', 125, '《千与千寻》是 2001 年宫崎骏执导、吉卜力工作室制作的动画电影。影片讲述 10 岁少女千寻随父母误入神灵世界，父母因贪吃变成猪，她被迫在魔女汤婆婆的浴场打工求生的故事。\r\n在这个光怪陆离的世界里，千寻结识了神秘少年白龙、无脸男等角色，历经锅炉房煤灰精灵的帮助、河神污物清理等考验，逐渐学会勇敢与独立。她凭借纯真善良打破咒语，不仅拯救了父母，还帮助白龙找回本名。\r\n影片以细腻画风构建奇幻世界观，融入日本神道教元素与环保主题，如河神身上的人类垃圾隐喻生态危机。千寻的成长历程充满哲思，那句 “千万不要忘记自己的名字” 成为核心隐喻，传递着对初心与勇气的赞美。该片获奥斯卡最佳动画长片奖，是全球动画史上的经典之作。', 9.4, 1208000, 151603.00, 1, '2025-05-28 14:38:58', 'picture\\\\千与千寻.jpg');
INSERT INTO `movie` VALUES (6, '肖申克的救赎', 'The Shawshank Redemption', '弗兰克·德拉邦特', '弗兰克·德拉邦特', '蒂姆·罗宾斯', '剧情', '美国', '英语', '1994-09-23', 142, '《肖申克的救赎》是 1994 年弗兰克・德拉邦特执导的美国剧情片，改编自斯蒂芬・金小说。银行家安迪（蒂姆・罗宾斯 饰）因被诬陷杀妻及情人入狱，在肖申克监狱受尽折磨，却始终心怀希望。他利用金融知识为典狱长洗钱，同时暗中用小鹤嘴锄挖通墙壁。\r\n狱中，他与黑人瑞德（摩根・弗里曼 饰）结为挚友，以音乐抚慰狱友心灵，还为监狱扩建图书馆。最终，安迪在一个雨夜通过排污管道逃出，揭露典狱长罪行。瑞德获释后，循着安迪留下的线索找到海边，两人在墨西哥重逢。\r\n影片以 “希望” 为核，用细腻叙事展现体制化对人的侵蚀与人性的坚韧。“有些鸟儿是关不住的，因为它们的羽毛太鲜亮” 成为经典隐喻，曾获 7 项奥斯卡提名，虽未获奖却常年稳居 IMDb 榜首，被视为影史最伟大的励志片之一。', 9.7, 2400000, 206301.00, 1, '2025-06-03 18:51:09', 'picture\\\\肖申克的救赎.jpg');
INSERT INTO `movie` VALUES (7, '盗梦空间', 'Inception', '克里斯托·弗罗兰', '克里斯托·弗罗兰', '莱昂纳多·迪卡普里奥', '科幻', '英国', '英语', '2010-09-01', 148, '\r\n《盗梦空间》是2010年克里斯托弗·诺兰执导的科幻悬疑电影，由莱昂纳多·迪卡普里奥主演。影片讲述盗梦师柯布（莱昂纳多 饰）带领团队通过潜入梦境窃取商业机密的故事，其核心设定是“梦中嵌套多层梦境”的复杂结构，每层梦境的时间流速不同（如“柯布旋转陀螺”成为贯穿全片的“图腾”，用于区分现实与梦境）。  \r\n\r\n柯布因妻子梅尔（玛丽昂·歌迪亚 饰）因沉迷梦境自杀而背负心理阴影，在接到最后一单“植入想法”的任务时，试图通过完成任务回到孩子身边。团队深入目标人物齐藤（渡边谦 饰）的潜意识，从第一层暴雨追车、第二层酒店失重格斗到第三层雪山堡垒，甚至进入潜意识边缘“迷失域”。过程中梅尔的幻影不断干扰，柯布最终直面内心愧疚，完成植入并疑似回到现实。  \r\n\r\n影片以精密的叙事结构、震撼的视觉效果（如折叠城市、无重力打斗）和哲学化的主题（现实与虚幻的边界、记忆与执念的困局）引发全球热议。诺兰通过“陀螺是否停止转动”的开放式结局，让观众持续探讨“什么是真实”，该片斩获4项奥斯卡奖，成为科幻电影中兼具商业与艺术深度的标杆之作。', 9.4, 1700000, 600907.00, 1, '2025-06-03 18:55:57', 'picture\\\\盗梦空间.jpg');
INSERT INTO `movie` VALUES (8, '卧虎藏龙', '卧虎藏龙', '李安', '王蕙玲', '周润发', '动作', '中国', '中文', '2000-07-08', 120, '《卧虎藏龙》是 2000 年由李安执导的武侠电影，改编自王度庐同名小说，融合东方武侠意境与西方哲学思考，被誉为武侠电影的革新之作。\r\n影片以清朝末年为背景，江湖高手李慕白（周润发 饰）决定退隐江湖，将随身宝剑 “青冥剑” 托付给红颜知己俞秀莲（杨紫琼 饰）送往京城。不料宝剑中途被盗，引出飞扬跋扈的 “玉娇龙”（章子怡 饰）—— 她出身贵族却向往江湖自由，偷剑后与李慕白、俞秀莲等人展开多场经典对决：竹林间衣袂翻飞的追逐、屋顶上轻盈灵动的缠斗，皆以诗意镜头展现武侠的飘逸与禅意。\r\n玉娇龙的叛逆与李慕白的克制形成鲜明对照，前者追求 “要什么就拿什么” 的率性，后者困于 “放不下” 的执念。影片突破传统武侠的正邪对立框架，深入探讨自由与责任、欲望与修行的矛盾。当李慕白因救玉娇龙中剧毒，临终前说出 “我已经浪费了一生”，道尽江湖人的遗憾与顿悟。\r\n李安以细腻的情感刻画和东方美学征服国际影坛，该片斩获奥斯卡最佳外语片等四项大奖，竹林打斗场景成为影史经典。“无论你对此生的决定为何，一定要真诚地对待自己” 的台词，更赋予武侠类型片深刻的哲学内核，使其超越类型边界，成为跨文化共鸣的东方传奇。', 8.4, 1200000, 153110.00, 1, '2025-06-03 19:02:57', 'picture\\\\卧虎藏龙.jpg');
INSERT INTO `movie` VALUES (9, '寄生虫', '기생충', '奉俊昊', '奉俊昊、韩进元', '宋康昊、李善均、崔宇植、朴素丹', '剧情', '韩国', '韩语', '2019-05-30', 132, '贫困的金氏家族通过伪造身份渗透进富豪朴社长家中，两个阶层的碰撞逐渐失控，最终引发血腥冲突。影片以荒诞寓言揭露阶级固化与社会矛盾。贫困的金氏家族通过伪造身份渗透进富豪朴社长家中，两个阶层的碰撞逐渐失控，最终引发血腥冲突。影片以荒诞寓言揭露阶级固化与社会矛盾。', 8.8, 1810000, 79000.00, 1, '2025-06-05 16:36:47', 'picture\\\\寄生虫.jpg');
INSERT INTO `movie` VALUES (10, '绿皮书', 'Green Book', '彼得·法雷里', '尼克·瓦莱隆加、布莱恩·海耶斯·库瑞', '维果·莫腾森、马赫沙拉·阿里', '喜剧', '美国', '英语', '2018-11-21', 130, '1962年，粗鲁的意大利裔司机托尼受雇为黑人钢琴家唐·雪利南下巡演护航，两人在种族歧视严重的南方用幽默与勇气打破偏见，建立跨越种族的友谊。', 8.9, 1470000, 48500.00, 1, '2025-06-05 16:40:36', 'picture\\\\绿皮书.jpg');
INSERT INTO `movie` VALUES (11, '少年的你', '少年的你', '曾国祥', '林咏琛、李媛、许伊萌', '周冬雨、易烊千玺', '剧情', '中国', '汉语普通话', '2019-10-25', 135, '高考前夕，少女陈念遭遇校园霸凌，小混混小北成为她的守护者。一场意外命案让两人卷入犯罪漩涡，在残酷青春中相互救赎。', 8.2, 1780000, 155700.00, 1, '2025-06-05 16:41:39', 'picture\\\\少年的你.jpg');
INSERT INTO `movie` VALUES (12, '何以为家', 'كفرناحوم, Capernaum)\r\nكفرناحوم, Capernaum', '娜丁·拉巴基', '娜丁·拉巴基', '赞恩·阿尔·拉菲亚', '剧情', '黎巴嫩/法国/美国', '阿拉伯语', '2018-05-17', 126, '12岁男孩赞恩因持刀伤人入狱，他起诉父母“生下自己”。影片跟随他流浪街头、照顾黑人婴儿的经历，控诉战争难民儿童的生存困境。', 9.1, 960000, 37400.00, 1, '2025-06-05 16:45:01', 'picture\\\\何以为家.jpg');
INSERT INTO `movie` VALUES (13, '小丑', 'Joker', '托德·菲利普斯', '托德·菲利普斯、斯科特·西尔弗\r\n\r\n', '华金·菲尼克斯', '剧情', '美国', '英语', '2019-10-04', 122, '底层喜剧演员亚瑟·弗莱克在哥谭市遭受社会抛弃与精神崩溃，逐渐蜕变为疯狂反派“小丑”，引发全城暴动。', 8.7, 1230000, 787000.00, 1, '2025-06-05 16:47:00', 'picture\\\\小丑.jpg');
INSERT INTO `movie` VALUES (14, '心灵奇旅', 'Soul', '彼特·道格特', '彼特·道格特、麦克·琼斯', '杰米·福克斯、蒂娜·菲（配音）', '动画', '美国', '英语', '2020-12-25', 101, '中学音乐教师乔伊死后灵魂误入“生之来处”，与厌世灵魂“22”携手返回地球，重新领悟生命真谛。', 8.7, 1120000, 57000.00, 1, '2025-06-05 16:51:11', 'picture\\\\心灵奇旅.jpg');
INSERT INTO `movie` VALUES (15, '1917', '萨姆·门德斯', '萨姆·门德斯', '萨姆·门德斯、克里斯蒂·威尔逊-凯恩斯', '乔治·麦凯、迪恩·查尔斯·查普曼', '剧情', '英国/美国', '英语', '2020-01-10', 119, '一战期间，两名英国士兵穿越德军防线传递撤退命令，一镜到底的沉浸式镜头展现战场生死时速。', 8.5, 760000, 53800.00, 1, '2025-06-05 16:53:09', 'picture\\\\1917.jpg');
INSERT INTO `movie` VALUES (16, '我不是药神', '我不是药神', '文牧野', '韩家女、钟伟、文牧野', '徐峥、王传君、谭卓', '喜剧', '中国', '汉语普通话', '2018-07-05', 117, '印度神油店老板程勇为救病人走私平价抗癌药，从牟利者变为民间英雄，推动中国医药改革。', 9.0, 2100000, 309900.00, 1, '2025-06-05 16:54:34', 'picture\\\\我不是药神.jpg');
INSERT INTO `movie` VALUES (17, '奥本海默', 'Oppenheimer', '克里斯托弗·诺兰', '克里斯托弗·诺兰', '基里安·墨菲、艾米莉·布朗特', '恐怖', '美国/英国', '英语', '2023-08-30', 180, '原子弹之父奥本海默主导曼哈顿计划，却在战后陷入政治迫害，科学与道德的冲突撕裂其人生。', 8.8, 980000, 60000.00, 1, '2025-06-05 16:56:17', 'picture\\\\奥本海默.jpg');
INSERT INTO `movie` VALUES (18, '摔跤吧！爸爸', 'Dangal', '涅提·蒂瓦里', '比于什·古普塔', '阿米尔·汗、萨卡诗·泰瓦', '纪录片', '印度', '印地语', '2017-05-05', 161, '前摔跤冠军马哈维亚训练女儿成为世界级摔跤手，打破印度性别偏见，赢得国家荣誉。', 9.0, 1570000, 129900.00, 1, '2025-06-05 16:58:38', 'picture\\\\摔跤吧！爸爸.jpg');
INSERT INTO `movie` VALUES (19, '疾速追杀', 'John Wick', '大卫·雷奇', '德里克·科尔斯塔', '基努·里维斯', '动作', '美国', '英语', '2014-10-24', 101, '退休杀手因爱犬被杀重出江湖，血洗黑帮复仇。', 7.7, 330000, 88000.00, 1, '2025-06-05 19:18:19', 'picture\\\\疾速追杀.jpg');
INSERT INTO `movie` VALUES (20, '碟中谍6：全面瓦解', 'Mission: Impossible – Fallout', '克里斯托弗·麦奎里', '克里斯托弗·麦奎里', '汤姆·克鲁斯', '动作', '美国', '英语', '2018-07-27', 147, '伊森·亨特为阻止核弹危机，高空跳伞、直升机缠斗玩命追击。', 8.1, 620000, 791000.00, 1, '2025-06-05 19:24:40', 'picture\\\\碟中谍6：全面瓦解.jpg');
INSERT INTO `movie` VALUES (21, '突袭2：暴徒', 'The Raid 2', '加雷斯·埃文斯', '加雷斯·埃文斯', '伊科·乌艾斯', '动作', '印度尼西亚', '印尼语', '2014-03-28', 150, '警察卧底黑帮家族，监狱暴动、厨房刀战打出暴力美学巅峰。', 8.0, 82000, 47000.00, 1, '2025-06-05 19:26:22', 'picture\\\\突袭2：暴徒.jpg');
INSERT INTO `movie` VALUES (22, '疯狂的麦克斯4：狂暴之路', 'Mad Max: Fury Road', '乔治·米勒', '乔治·米勒', '汤姆·哈迪、查理兹·塞隆', '动作', '澳大利亚/美国', '英语', '2015-05-15', 120, '废土世界逃亡车队与独裁者展开末日飞车大战。', 8.6, 490000, 210000.00, 1, '2025-06-05 19:26:48', 'picture\\\\疯狂的麦克斯4：狂暴之路.jpg');
INSERT INTO `movie` VALUES (23, '大独裁者', 'The Great Dictator', '查理·卓别林', '查理·卓别林', '查理·卓别林', '喜剧', '美国', '英语\r\n\r\n', '1940-10-15', 125, '理发师被误认为独裁者，用荒谬演讲讽刺纳粹主义。', 9.2, 180000, 65260.00, 1, '2025-06-05 19:30:23', 'picture\\\\大独裁者.jpg');
INSERT INTO `movie` VALUES (24, '三傻大闹宝莱坞', '3 Idiots', '拉吉库马尔·希拉尼', '维德胡·维诺德·乔普拉', '阿米尔·汗', '喜剧', '印度', '印地语', '2011-12-08', 171, '三名工程学生反抗僵化教育制度，追寻人生真义。', 9.2, 1830000, 200000.00, 1, '2025-06-05 19:31:48', 'picture\\\\三傻大闹宝莱坞.jpg');
INSERT INTO `movie` VALUES (25, '爱在黎明破晓前', 'Before Sunrise', '理查德·林克莱特', '理查德·林克莱特', '伊桑·霍克、朱莉·德尔佩', '爱情', '美国/奥地利', '英语', '1995-01-27', 101, '火车偶遇的男女在维也纳一夜漫步，探讨爱情与人生。', 8.8, 660000, 38500.00, 1, '2025-06-05 19:32:25', 'picture\\\\爱在黎明破晓前.jpg');
INSERT INTO `movie` VALUES (26, '你的名字。', '君の名は。', '新海诚', '新海诚', '神木隆之介、上白石萌音（配音）', '爱情', '日本', '日语', '2016-12-02', 106, '城乡少男少女身体互换，跨越时空拯救被彗星毁灭的小镇。', 8.5, 1220000, 577777.00, 1, '2025-06-05 19:34:33', 'picture\\\\你的名字。.jpg');
INSERT INTO `movie` VALUES (27, '甜蜜蜜', 'Comrades: Almost a Love Story', '陈可辛', '岸西', '黎明、张曼玉', '爱情', '中国香港', '粤语', '1996-11-02', 118, '80年代香港新移民在邓丽君歌声中经历十年错位爱情。', 8.9, 480000, 15560.00, 1, '2025-06-05 19:37:18', 'picture\\\\甜蜜蜜.jpg');
INSERT INTO `movie` VALUES (28, '银翼杀手2049', 'Blade Runner 2049', '丹尼斯·维伦纽瓦', '汉普顿·范彻', '瑞恩·高斯林、哈里森·福特', '科幻', '美国/加拿大', '英语', '2017-10-27', 164, '复制人K发现失踪儿童秘密，引发人类与AI生存权之战。', 8.3, 440000, 259000.00, 1, '2025-06-05 19:38:14', 'picture\\\\银翼杀手2049.jpg');
INSERT INTO `movie` VALUES (29, '降临', 'Arrival', '丹尼斯·维伦纽瓦', '埃里克·海瑟尔', '艾米·亚当斯', '科幻', '美国', '英语', '2017-01-20', 116, '语言学家破译外星文字，预见未来化解全球危机。', 7.8, 410000, 203000.00, 1, '2025-06-05 19:38:56', 'picture\\\\降临.jpg');
INSERT INTO `movie` VALUES (30, '闪灵', 'The Shining', '斯坦利·库布里克', '斯坦利·库布里克', '杰克·尼科尔森', '恐怖', '英国/美国', '英语', '1980-05-23', 146, '作家携家看守雪山酒店，在灵异侵蚀中陷入癫狂。', 8.3, 390000, 460000.00, 1, '2025-06-05 19:46:01', 'picture\\\\闪灵.jpg');
INSERT INTO `movie` VALUES (31, '遗传厄运', 'Hereditary', '阿里·艾斯特', '阿里·艾斯特', '托妮·科莱特', '恐怖', '美国', '英语', '2018-06-08', 127, '母亲继承邪教遗产，全家沦为恶魔献祭品。', 7.3, 220000, 61000.00, 1, '2025-06-05 19:47:23', 'picture\\\\遗传厄运.jpg');
INSERT INTO `movie` VALUES (32, '咒怨', '呪怨', '清水崇', '清水崇', '奥菜惠', '恐怖', '日本', '日语', '2003-01-25', 92, '闯入凶宅者皆遭怨灵伽椰子索命，诅咒如病毒蔓延。', 7.6, 120000, 30000.00, 1, '2025-06-05 19:48:30', 'picture\\\\咒怨.jpg');
INSERT INTO `movie` VALUES (33, '釜山行', '부산행', '延尚昊', '延尚昊', '孔刘、马东锡', '恐怖', '韩国', '韩语', '2016-07-20', 118, '丧尸病毒在开往釜山列车爆发，人性善恶在车厢激斗。', 8.6, 1040000, 630000.00, 1, '2025-06-05 19:51:39', 'picture\\\\釜山行.jpg');
INSERT INTO `movie` VALUES (34, '机器人总动员', 'WALL·E', '安德鲁·斯坦顿', '安德鲁·斯坦顿', '本·贝尔特（配音）', '动画', '美国', '英语', '2008-06-27', 98, '垃圾清理机器人偶遇探测女机器人，携手拯救人类文明。', 9.3, 1270000, 521000.00, 1, '2025-06-05 19:53:05', 'picture\\\\机器人总动员.jpg');
INSERT INTO `movie` VALUES (35, '红辣椒', 'パプリカ', '今敏', '今敏', '林原惠美（配音）', '动画', '日本', '日语', '2006-11-25', 90, '梦境治疗师潜入连环噩梦，阻止精神武器吞噬现实。', 9.1, 280000, 12000.00, 1, '2025-06-05 19:54:39', 'picture\\\\红辣椒.jpg');
INSERT INTO `movie` VALUES (36, '寻梦环游记', 'Coco', '李·昂克里奇', '阿德里安·莫利纳', '安东尼·冈萨雷斯（配音）', '动画', '美国', '英语/西班牙语', '2017-11-24', 105, '男孩闯入亡灵世界，揭穿歌神谋杀案重连家族记忆。', 9.1, 1760000, 807000.00, 1, '2025-06-05 19:56:17', 'picture\\\\寻梦环游记.jpg');
INSERT INTO `movie` VALUES (37, '禁闭岛', 'Shutter Island', '马丁·斯科塞斯', '莱塔·卡罗格里迪斯', '莱昂纳多·迪卡普里奥', '悬疑', '美国', '英语', '2010-02-19', 138, '联邦警探调查精神病院失踪案，反陷自我认知迷局。', 8.9, 980000, 29500.00, 1, '2025-06-05 19:57:55', 'picture\\\\禁闭岛.jpg');
INSERT INTO `movie` VALUES (38, '消失的爱人', 'Gone Girl', '大卫·芬奇', '吉莉安·弗琳', '本·阿弗莱克', '悬疑', '美国', '英语', '2014-10-03', 149, '丈夫成杀妻嫌犯，妻子伪造失踪案操控舆论复仇。', 8.7, 840000, 369000.00, 1, '2025-06-05 19:58:13', 'picture\\\\消失的爱人.jpg');
INSERT INTO `movie` VALUES (39, '看不见的客人', 'Contratiempo', '奥里奥尔·保罗', '奥里奥尔·保罗', '马里奥·卡萨斯', '悬疑', '西班牙', '西班牙语', '2017-09-15', 106, '企业家被控谋杀情人，女律师层层拆穿其43个谎言。', 8.8, 1660000, 172000.00, 1, '2025-06-05 20:00:04', 'picture\\\\看不见的客人.jpg');
INSERT INTO `movie` VALUES (40, '杀人回忆', '살인의 추억', '奉俊昊', '奉俊昊', '宋康昊', '悬疑', '韩国', '韩语', '2003-05-02', 132, '小镇连环奸杀案成悬案，警察在绝望中见证时代之恶。', 8.9, 680000, 18000.00, 1, '2025-06-05 20:03:07', 'picture\\\\杀人回忆.jpg');
INSERT INTO `movie` VALUES (41, '致命魔术', 'The Prestige', '克里斯托弗·诺兰', '克里斯托弗·诺兰', '休·杰克曼、克里斯蒂安·贝尔', '悬疑', '英国/美国', '英语', '2006-10-20', 130, '19世纪魔术师为终极魔术互相残杀，牺牲伦理追求完美。', 8.9, 790000, 109000.00, 1, '2025-06-05 20:04:14', 'picture\\\\致命魔术.jpg');
INSERT INTO `movie` VALUES (42, '海豚湾', 'The Cove', '路易·西霍尤斯', '马克·蒙雷', '理查德·奥巴瑞（本人）', '纪录片', '美国', '英语/日语', '2009-07-31', 92, '揭秘日本太地町屠杀海豚真相，冒险拍摄触目惊心。', 9.3, 180000, 11000.00, 1, '2025-06-05 20:06:16', 'picture\\\\海豚湾.jpg');
INSERT INTO `movie` VALUES (43, '地球脉动II', 'Planet Earth II', '伊丽莎白·怀特', '大卫·爱登堡', '大卫·爱登堡（解说）', '纪录片', '英国', '英语', '2016-11-06', 300, '4K技术记录岛屿/山脉/丛林等生态奇观，展现生命韧性。', 9.9, 60000, 0.00, 1, '2025-06-05 20:06:48', 'picture\\\\地球脉动II.jpg');
INSERT INTO `movie` VALUES (44, '华氏911', 'Fahrenheit 9/11', '迈克尔·摩尔', '迈克尔·摩尔', '乔治·布什（资料影像）', '纪录片', '美国', '英语', '2004-06-25', 122, '揭露布什家族与沙特财团利益链，批判伊拉克战争谎言。', 8.0, 35000, 222000.00, 1, '2025-06-05 20:09:15', 'picture\\\\华氏911.jpg');
INSERT INTO `movie` VALUES (45, '四个春天', 'Four Springs', '陆庆屹', '陆庆屹', '陆家父母（本人）', '纪录片', '中国', '贵州话', '2019-01-04', 105, '导演用四年记录贵州父母日常生活，诗意凝视衰老与离别。', 8.8, 140000, 10780.00, 1, '2025-06-05 20:09:43', 'picture\\\\四个春天.jpg');

-- ----------------------------
-- Table structure for order
-- ----------------------------
DROP TABLE IF EXISTS `order`;
CREATE TABLE `order`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '订单ID',
  `order_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '订单号',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `screening_id` bigint NOT NULL COMMENT '排片ID',
  `total_price` decimal(8, 2) NOT NULL COMMENT '总价',
  `payment_method` tinyint NULL DEFAULT 0 COMMENT '支付方式：0-未支付，1-支付宝，2-微信支付',
  `payment_time` datetime NULL DEFAULT NULL COMMENT '支付时间',
  `order_status` tinyint NULL DEFAULT 0 COMMENT '订单状态：0-待支付，1-已支付，2-已完成，3-已取消，4-已退票',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `order_no`(`order_no` ASC) USING BTREE,
  INDEX `user_id`(`user_id` ASC) USING BTREE,
  INDEX `screening_id`(`screening_id` ASC) USING BTREE,
  CONSTRAINT `order_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `order_ibfk_2` FOREIGN KEY (`screening_id`) REFERENCES `screening` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 62 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of order
-- ----------------------------
INSERT INTO `order` VALUES (57, '8f6c90ea-ebf0-43df-9c8d-348821db44eb', 1, 5789, 39.98, 2, '2025-06-12 10:13:09', 1, '2025-06-12 10:13:09', '2025-06-12 10:13:09');
INSERT INTO `order` VALUES (58, '8b0192c1-c97c-444c-be4e-4dabe312012f', 1, 5787, 189.44, 1, '2025-06-12 10:39:55', 1, '2025-06-12 10:39:55', '2025-06-12 10:39:55');
INSERT INTO `order` VALUES (59, '50405a1d-863c-49a0-b89a-d054ad40d159', 1, 5753, 455.04, 2, '2025-06-12 10:54:52', 1, '2025-06-12 10:54:52', '2025-06-12 10:54:52');
INSERT INTO `order` VALUES (60, '69d183dc-3ea9-46cf-8962-9b86463ec26c', 1, 5753, 151.68, 2, '2025-06-12 14:40:09', 1, '2025-06-12 14:40:09', '2025-06-12 14:40:09');
INSERT INTO `order` VALUES (61, 'b3fcd44f-1c82-43a4-9a53-63925ec2c680', 1, 5750, 134.52, 1, '2025-06-12 14:40:46', 1, '2025-06-12 14:40:46', '2025-06-12 14:40:46');

-- ----------------------------
-- Table structure for order_seat
-- ----------------------------
DROP TABLE IF EXISTS `order_seat`;
CREATE TABLE `order_seat`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `order_id` bigint NOT NULL COMMENT '订单ID',
  `screening_id` bigint NOT NULL COMMENT '场次ID',
  `seat_row` int NOT NULL COMMENT '座位行',
  `seat_col` int NOT NULL COMMENT '座位列',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `order_id`(`order_id` ASC) USING BTREE,
  INDEX `screening_id`(`screening_id` ASC) USING BTREE,
  CONSTRAINT `order_seat_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `order` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `order_seat_ibfk_2` FOREIGN KEY (`screening_id`) REFERENCES `screening` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 20 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of order_seat
-- ----------------------------
INSERT INTO `order_seat` VALUES (5, 57, 5789, 4, 9, '2025-06-12 10:13:09');
INSERT INTO `order_seat` VALUES (6, 58, 5787, 0, 6, '2025-06-12 10:39:55');
INSERT INTO `order_seat` VALUES (7, 58, 5787, 0, 7, '2025-06-12 10:39:55');
INSERT INTO `order_seat` VALUES (8, 58, 5787, 0, 8, '2025-06-12 10:39:55');
INSERT INTO `order_seat` VALUES (9, 58, 5787, 0, 9, '2025-06-12 10:39:55');
INSERT INTO `order_seat` VALUES (10, 59, 5753, 1, 1, '2025-06-12 10:54:52');
INSERT INTO `order_seat` VALUES (11, 59, 5753, 1, 2, '2025-06-12 10:54:52');
INSERT INTO `order_seat` VALUES (12, 59, 5753, 5, 3, '2025-06-12 10:54:52');
INSERT INTO `order_seat` VALUES (13, 59, 5753, 5, 2, '2025-06-12 10:54:52');
INSERT INTO `order_seat` VALUES (14, 59, 5753, 7, 7, '2025-06-12 10:54:52');
INSERT INTO `order_seat` VALUES (15, 59, 5753, 3, 8, '2025-06-12 10:54:52');
INSERT INTO `order_seat` VALUES (16, 60, 5753, 0, 0, '2025-06-12 14:40:09');
INSERT INTO `order_seat` VALUES (17, 60, 5753, 0, 1, '2025-06-12 14:40:09');
INSERT INTO `order_seat` VALUES (18, 61, 5750, 2, 6, '2025-06-12 14:40:46');
INSERT INTO `order_seat` VALUES (19, 61, 5750, 2, 7, '2025-06-12 14:40:46');

-- ----------------------------
-- Table structure for screening
-- ----------------------------
DROP TABLE IF EXISTS `screening`;
CREATE TABLE `screening`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '排片ID',
  `movie_id` bigint NOT NULL COMMENT '影片ID',
  `hall_id` bigint NOT NULL COMMENT '影厅ID',
  `start_time` datetime NOT NULL COMMENT '开始时间',
  `end_time` datetime NOT NULL COMMENT '结束时间',
  `price` decimal(8, 2) NOT NULL COMMENT '票价',
  `create_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `status` tinyint NULL DEFAULT NULL COMMENT '状态：0-未开始，1-售票中，2-已结束，3-已取消',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `movie_id`(`movie_id` ASC) USING BTREE,
  INDEX `hall_id`(`hall_id` ASC) USING BTREE,
  CONSTRAINT `screening_ibfk_1` FOREIGN KEY (`movie_id`) REFERENCES `movie` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `screening_ibfk_2` FOREIGN KEY (`hall_id`) REFERENCES `hall` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 6282 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of screening
-- ----------------------------
INSERT INTO `screening` VALUES (5742, 1, 12, '2025-06-14 15:51:00', '2025-06-14 17:51:00', 65.60, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5743, 1, 11, '2025-06-20 05:51:26', '2025-06-20 07:51:26', 66.86, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5744, 1, 10, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 50.03, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5745, 1, 9, '2025-06-17 19:51:26', '2025-06-17 21:51:26', 78.84, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5746, 1, 8, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 57.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5747, 1, 7, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 71.49, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5748, 1, 6, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 74.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5749, 1, 5, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 43.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5750, 1, 4, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 67.26, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5751, 1, 3, '2025-06-19 07:51:26', '2025-06-19 09:51:26', 77.76, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5752, 1, 2, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 62.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5753, 1, 1, '2025-06-14 15:51:26', '2025-06-14 17:51:26', 75.84, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5754, 2, 12, '2025-06-14 09:51:26', '2025-06-14 11:51:26', 71.76, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5755, 2, 11, '2025-06-18 21:51:26', '2025-06-18 23:51:26', 50.78, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5756, 2, 10, '2025-06-16 21:51:26', '2025-06-16 23:51:26', 49.02, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5757, 2, 9, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 69.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5758, 2, 8, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 66.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5759, 2, 7, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 52.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5760, 2, 6, '2025-06-13 21:51:26', '2025-06-13 23:51:26', 37.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5761, 2, 5, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 52.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5762, 2, 4, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 37.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5763, 2, 3, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 61.84, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5764, 2, 2, '2025-06-20 01:51:26', '2025-06-20 03:51:26', 70.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5765, 2, 1, '2025-06-15 05:51:26', '2025-06-15 07:51:26', 70.09, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5766, 3, 12, '2025-06-14 23:51:26', '2025-06-15 01:51:26', 63.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5767, 3, 11, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 42.89, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5768, 3, 10, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 60.01, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5769, 3, 9, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 79.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5770, 3, 8, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 63.64, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5771, 3, 7, '2025-06-13 19:51:26', '2025-06-13 21:51:26', 46.93, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5772, 3, 6, '2025-06-15 03:51:26', '2025-06-15 05:51:26', 48.93, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5773, 3, 5, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 57.23, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5774, 3, 4, '2025-06-19 07:51:26', '2025-06-19 09:51:26', 62.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5775, 3, 3, '2025-06-17 13:51:26', '2025-06-17 15:51:26', 79.75, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5776, 3, 2, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 56.30, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5777, 3, 1, '2025-06-17 01:51:26', '2025-06-17 03:51:26', 36.91, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5778, 4, 12, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 59.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5779, 4, 11, '2025-06-17 07:51:26', '2025-06-17 09:51:26', 36.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5780, 4, 10, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 65.47, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5781, 4, 9, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 60.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5782, 4, 8, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 74.06, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5783, 4, 7, '2025-06-14 21:51:26', '2025-06-14 23:51:26', 48.43, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5784, 4, 6, '2025-06-20 05:51:26', '2025-06-20 07:51:26', 73.65, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5785, 4, 5, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 63.40, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5786, 4, 4, '2025-06-19 09:51:26', '2025-06-19 11:51:26', 46.73, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5787, 4, 3, '2025-06-19 07:51:26', '2025-06-19 09:51:26', 47.36, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5788, 4, 2, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 74.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5789, 4, 1, '2025-06-17 09:51:26', '2025-06-17 11:51:26', 39.98, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5790, 5, 12, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 46.16, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5791, 5, 11, '2025-06-17 01:51:26', '2025-06-17 03:51:26', 67.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5792, 5, 10, '2025-06-14 09:51:26', '2025-06-14 11:51:26', 52.64, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5793, 5, 9, '2025-06-18 01:51:26', '2025-06-18 03:51:26', 79.75, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5794, 5, 8, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 51.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5795, 5, 7, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 36.50, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5796, 5, 6, '2025-06-15 13:51:26', '2025-06-15 15:51:26', 49.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5797, 5, 5, '2025-06-19 01:51:26', '2025-06-19 03:51:26', 75.16, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5798, 5, 4, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 36.11, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5799, 5, 3, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 54.65, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5800, 5, 2, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 38.42, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5801, 5, 1, '2025-06-14 15:51:26', '2025-06-14 17:51:26', 58.11, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5802, 6, 12, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 38.29, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5803, 6, 11, '2025-06-20 13:51:26', '2025-06-20 15:51:26', 69.57, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5804, 6, 10, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 77.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5805, 6, 9, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 74.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5806, 6, 8, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 43.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5807, 6, 7, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 60.00, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5808, 6, 6, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 77.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5809, 6, 5, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 70.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5810, 6, 4, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 59.18, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5811, 6, 3, '2025-06-17 09:51:26', '2025-06-17 11:51:26', 40.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5812, 6, 2, '2025-06-20 09:51:26', '2025-06-20 11:51:26', 57.66, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5813, 6, 1, '2025-06-17 17:51:26', '2025-06-17 19:51:26', 55.62, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5814, 7, 12, '2025-06-17 03:51:26', '2025-06-17 05:51:26', 42.85, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5815, 7, 11, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 43.65, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5816, 7, 10, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 38.75, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5817, 7, 9, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 73.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5818, 7, 8, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 55.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5819, 7, 7, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 78.32, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5820, 7, 6, '2025-06-17 21:51:26', '2025-06-17 23:51:26', 43.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5821, 7, 5, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 39.31, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5822, 7, 4, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 36.75, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5823, 7, 3, '2025-06-20 13:51:26', '2025-06-20 15:51:26', 74.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5824, 7, 2, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 47.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5825, 7, 1, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 51.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5826, 8, 12, '2025-06-14 17:51:26', '2025-06-14 19:51:26', 65.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5827, 8, 11, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 52.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5828, 8, 10, '2025-06-15 17:51:26', '2025-06-15 19:51:26', 50.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5829, 8, 9, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 41.84, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5830, 8, 8, '2025-06-15 05:51:26', '2025-06-15 07:51:26', 67.94, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5831, 8, 7, '2025-06-20 05:51:26', '2025-06-20 07:51:26', 59.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5832, 8, 6, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 64.80, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5833, 8, 5, '2025-06-18 19:51:26', '2025-06-18 21:51:26', 67.68, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5834, 8, 4, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 72.79, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5835, 8, 3, '2025-06-20 11:51:26', '2025-06-20 13:51:26', 53.80, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5836, 8, 2, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 52.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5837, 8, 1, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 56.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5838, 9, 12, '2025-06-19 05:51:26', '2025-06-19 07:51:26', 62.15, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5839, 9, 11, '2025-06-17 19:51:26', '2025-06-17 21:51:26', 43.42, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5840, 9, 10, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 40.66, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5841, 9, 9, '2025-06-15 03:51:26', '2025-06-15 05:51:26', 66.81, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5842, 9, 8, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 48.42, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5843, 9, 7, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 48.71, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5844, 9, 6, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 39.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5845, 9, 5, '2025-06-17 03:51:26', '2025-06-17 05:51:26', 45.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5846, 9, 4, '2025-06-18 05:51:26', '2025-06-18 07:51:26', 61.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5847, 9, 3, '2025-06-20 13:51:26', '2025-06-20 15:51:26', 43.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5848, 9, 2, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 53.51, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5849, 9, 1, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 36.01, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5850, 10, 12, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 67.57, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5851, 10, 11, '2025-06-18 19:51:26', '2025-06-18 21:51:26', 59.83, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5852, 10, 10, '2025-06-17 07:51:26', '2025-06-17 09:51:26', 78.52, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5853, 10, 9, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 53.36, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5854, 10, 8, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 37.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5855, 10, 7, '2025-06-16 23:51:26', '2025-06-17 01:51:26', 47.83, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5856, 10, 6, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 78.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5857, 10, 5, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 68.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5858, 10, 4, '2025-06-20 11:51:26', '2025-06-20 13:51:26', 63.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5859, 10, 3, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 53.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5860, 10, 2, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 43.51, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5861, 10, 1, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 71.91, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5862, 11, 12, '2025-06-19 15:51:26', '2025-06-19 17:51:26', 74.62, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5863, 11, 11, '2025-06-19 05:51:26', '2025-06-19 07:51:26', 50.65, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5864, 11, 10, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 65.79, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5865, 11, 9, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 74.06, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5866, 11, 8, '2025-06-14 21:51:26', '2025-06-14 23:51:26', 50.08, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5867, 11, 7, '2025-06-14 09:51:26', '2025-06-14 11:51:26', 60.00, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5868, 11, 6, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 59.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5869, 11, 5, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 46.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5870, 11, 4, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 73.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5871, 11, 3, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 42.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5872, 11, 2, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 61.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5873, 11, 1, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 58.71, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5874, 12, 12, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 68.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5875, 12, 11, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 52.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5876, 12, 10, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 59.63, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5877, 12, 9, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 78.66, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5878, 12, 8, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 57.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5879, 12, 7, '2025-06-17 01:51:26', '2025-06-17 03:51:26', 77.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5880, 12, 6, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 52.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5881, 12, 5, '2025-06-14 23:51:26', '2025-06-15 01:51:26', 72.34, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5882, 12, 4, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 48.02, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5883, 12, 3, '2025-06-19 01:51:26', '2025-06-19 03:51:26', 36.36, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5884, 12, 2, '2025-06-19 07:51:26', '2025-06-19 09:51:26', 78.71, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5885, 12, 1, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 43.12, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5886, 13, 12, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 65.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5887, 13, 11, '2025-06-17 01:51:26', '2025-06-17 03:51:26', 54.07, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5888, 13, 10, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 74.23, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5889, 13, 9, '2025-06-16 21:51:26', '2025-06-16 23:51:26', 68.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5890, 13, 8, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 51.68, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5891, 13, 7, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 48.89, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5892, 13, 6, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 58.85, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5893, 13, 5, '2025-06-20 09:51:26', '2025-06-20 11:51:26', 48.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5894, 13, 4, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 68.12, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5895, 13, 3, '2025-06-14 09:51:26', '2025-06-14 11:51:26', 51.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5896, 13, 2, '2025-06-17 07:51:26', '2025-06-17 09:51:26', 59.34, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5897, 13, 1, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 74.66, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5898, 14, 12, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 74.60, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5899, 14, 11, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 70.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5900, 14, 10, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 37.26, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5901, 14, 9, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 73.91, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5902, 14, 8, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 78.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5903, 14, 7, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 68.49, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5904, 14, 6, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 51.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5905, 14, 5, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 46.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5906, 14, 4, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 55.53, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5907, 14, 3, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 53.89, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5908, 14, 2, '2025-06-15 03:51:26', '2025-06-15 05:51:26', 74.12, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5909, 14, 1, '2025-06-18 07:51:26', '2025-06-18 09:51:26', 68.37, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5910, 15, 12, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 46.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5911, 15, 11, '2025-06-15 03:51:26', '2025-06-15 05:51:26', 50.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5912, 15, 10, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 35.81, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5913, 15, 9, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 49.11, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5914, 15, 8, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 70.83, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5915, 15, 7, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 48.78, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5916, 15, 6, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 64.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5917, 15, 5, '2025-06-14 09:51:26', '2025-06-14 11:51:26', 62.42, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5918, 15, 4, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 67.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5919, 15, 3, '2025-06-16 21:51:26', '2025-06-16 23:51:26', 42.61, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5920, 15, 2, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 68.50, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5921, 15, 1, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 63.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5922, 16, 12, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 42.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5923, 16, 11, '2025-06-19 05:51:26', '2025-06-19 07:51:26', 57.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5924, 16, 10, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 79.93, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5925, 16, 9, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 56.76, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5926, 16, 8, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 43.95, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5927, 16, 7, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 54.23, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5928, 16, 6, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 49.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5929, 16, 5, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 52.09, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5930, 16, 4, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 46.95, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5931, 16, 3, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 63.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5932, 16, 2, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 58.32, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5933, 16, 1, '2025-06-20 05:51:26', '2025-06-20 07:51:26', 44.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5934, 17, 12, '2025-06-14 19:51:26', '2025-06-14 21:51:26', 45.76, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5935, 17, 11, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 66.23, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5936, 17, 10, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 36.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5937, 17, 9, '2025-06-19 21:51:26', '2025-06-19 23:51:26', 51.73, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5938, 17, 8, '2025-06-14 19:51:26', '2025-06-14 21:51:26', 69.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5939, 17, 7, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 49.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5940, 17, 6, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 41.72, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5941, 17, 5, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 77.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5942, 17, 4, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 65.19, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5943, 17, 3, '2025-06-13 21:51:26', '2025-06-13 23:51:26', 44.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5944, 17, 2, '2025-06-20 01:51:26', '2025-06-20 03:51:26', 79.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5945, 17, 1, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 37.00, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5946, 18, 12, '2025-06-17 19:51:26', '2025-06-17 21:51:26', 73.89, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5947, 18, 11, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 35.98, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5948, 18, 10, '2025-06-17 09:51:26', '2025-06-17 11:51:26', 63.65, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5949, 18, 9, '2025-06-17 13:51:26', '2025-06-17 15:51:26', 75.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5950, 18, 8, '2025-06-19 05:51:26', '2025-06-19 07:51:26', 49.98, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5951, 18, 7, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 45.86, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5952, 18, 6, '2025-06-16 19:51:26', '2025-06-16 21:51:26', 61.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5953, 18, 5, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 35.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5954, 18, 4, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 68.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5955, 18, 3, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 43.80, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5956, 18, 2, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 79.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5957, 18, 1, '2025-06-14 17:51:26', '2025-06-14 19:51:26', 74.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5958, 19, 12, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 69.12, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5959, 19, 11, '2025-06-14 17:51:26', '2025-06-14 19:51:26', 59.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5960, 19, 10, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 63.01, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5961, 19, 9, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 74.47, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5962, 19, 8, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 37.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5963, 19, 7, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 50.95, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5964, 19, 6, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 41.37, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5965, 19, 5, '2025-06-14 21:51:26', '2025-06-14 23:51:26', 57.59, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5966, 19, 4, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 46.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5967, 19, 3, '2025-06-16 19:51:26', '2025-06-16 21:51:26', 57.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5968, 19, 2, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 39.51, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5969, 19, 1, '2025-06-14 15:51:26', '2025-06-14 17:51:26', 53.73, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5970, 20, 12, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 35.19, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5971, 20, 11, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 50.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5972, 20, 10, '2025-06-16 19:51:26', '2025-06-16 21:51:26', 48.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5973, 20, 9, '2025-06-14 17:51:26', '2025-06-14 19:51:26', 75.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5974, 20, 8, '2025-06-20 09:51:26', '2025-06-20 11:51:26', 42.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5975, 20, 7, '2025-06-20 09:51:26', '2025-06-20 11:51:26', 49.52, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5976, 20, 6, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 59.15, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5977, 20, 5, '2025-06-17 15:51:26', '2025-06-17 17:51:26', 48.19, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5978, 20, 4, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 68.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5979, 20, 3, '2025-06-17 07:51:26', '2025-06-17 09:51:26', 54.83, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5980, 20, 2, '2025-06-17 19:51:26', '2025-06-17 21:51:26', 66.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5981, 20, 1, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 53.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5982, 21, 12, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 50.73, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5983, 21, 11, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 35.11, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5984, 21, 10, '2025-06-20 11:51:26', '2025-06-20 13:51:26', 75.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5985, 21, 9, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 37.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5986, 21, 8, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 38.53, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5987, 21, 7, '2025-06-16 15:51:26', '2025-06-16 17:51:26', 77.08, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5988, 21, 6, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 37.84, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5989, 21, 5, '2025-06-14 23:51:26', '2025-06-15 01:51:26', 70.29, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5990, 21, 4, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 49.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5991, 21, 3, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 45.06, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5992, 21, 2, '2025-06-14 21:51:26', '2025-06-14 23:51:26', 47.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5993, 21, 1, '2025-06-19 03:51:26', '2025-06-19 05:51:26', 42.05, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5994, 22, 12, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 58.80, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5995, 22, 11, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 63.71, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5996, 22, 10, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 51.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5997, 22, 9, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 40.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5998, 22, 8, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 46.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (5999, 22, 7, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 71.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6000, 22, 6, '2025-06-17 07:51:26', '2025-06-17 09:51:26', 44.15, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6001, 22, 5, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 56.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6002, 22, 4, '2025-06-14 17:51:26', '2025-06-14 19:51:26', 50.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6003, 22, 3, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 48.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6004, 22, 2, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 68.26, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6005, 22, 1, '2025-06-17 01:51:26', '2025-06-17 03:51:26', 46.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6006, 23, 12, '2025-06-19 01:51:26', '2025-06-19 03:51:26', 40.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6007, 23, 11, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 46.30, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6008, 23, 10, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 61.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6009, 23, 9, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 68.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6010, 23, 8, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 68.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6011, 23, 7, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 58.00, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6012, 23, 6, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 35.99, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6013, 23, 5, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 71.85, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6014, 23, 4, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 51.16, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6015, 23, 3, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 55.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6016, 23, 2, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 52.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6017, 23, 1, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 44.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6018, 24, 12, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 63.49, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6019, 24, 11, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 39.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6020, 24, 10, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 36.55, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6021, 24, 9, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 72.52, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6022, 24, 8, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 58.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6023, 24, 7, '2025-06-18 01:51:26', '2025-06-18 03:51:26', 61.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6024, 24, 6, '2025-06-13 19:51:26', '2025-06-13 21:51:26', 52.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6025, 24, 5, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 38.51, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6026, 24, 4, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 79.63, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6027, 24, 3, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 41.32, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6028, 24, 2, '2025-06-16 15:51:26', '2025-06-16 17:51:26', 68.50, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6029, 24, 1, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 74.68, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6030, 25, 12, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 37.43, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6031, 25, 11, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 38.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6032, 25, 10, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 43.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6033, 25, 9, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 68.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6034, 25, 8, '2025-06-20 05:51:26', '2025-06-20 07:51:26', 57.18, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6035, 25, 7, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 64.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6036, 25, 6, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 79.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6037, 25, 5, '2025-06-19 03:51:26', '2025-06-19 05:51:26', 35.08, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6038, 25, 4, '2025-06-17 21:51:26', '2025-06-17 23:51:26', 38.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6039, 25, 3, '2025-06-17 15:51:26', '2025-06-17 17:51:26', 62.85, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6040, 25, 2, '2025-06-16 03:51:26', '2025-06-16 05:51:26', 79.37, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6041, 25, 1, '2025-06-19 09:51:26', '2025-06-19 11:51:26', 42.34, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6042, 26, 12, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 45.09, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6043, 26, 11, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 70.70, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6044, 26, 10, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 37.50, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6045, 26, 9, '2025-06-15 03:51:26', '2025-06-15 05:51:26', 76.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6046, 26, 8, '2025-06-20 01:51:26', '2025-06-20 03:51:26', 73.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6047, 26, 7, '2025-06-17 13:51:26', '2025-06-17 15:51:26', 45.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6048, 26, 6, '2025-06-16 15:51:26', '2025-06-16 17:51:26', 58.08, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6049, 26, 5, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 66.72, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6050, 26, 4, '2025-06-19 01:51:26', '2025-06-19 03:51:26', 69.98, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6051, 26, 3, '2025-06-17 11:51:26', '2025-06-17 13:51:26', 54.18, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6052, 26, 2, '2025-06-16 23:51:26', '2025-06-17 01:51:26', 39.61, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6053, 26, 1, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 39.91, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6054, 27, 12, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 41.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6055, 27, 11, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 76.93, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6056, 27, 10, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 49.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6057, 27, 9, '2025-06-17 09:51:26', '2025-06-17 11:51:26', 68.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6058, 27, 8, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 53.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6059, 27, 7, '2025-06-18 05:51:26', '2025-06-18 07:51:26', 37.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6060, 27, 6, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 48.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6061, 27, 5, '2025-06-17 21:51:26', '2025-06-17 23:51:26', 42.16, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6062, 27, 4, '2025-06-20 09:51:26', '2025-06-20 11:51:26', 50.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6063, 27, 3, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 48.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6064, 27, 2, '2025-06-20 01:51:26', '2025-06-20 03:51:26', 65.31, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6065, 27, 1, '2025-06-17 21:51:26', '2025-06-17 23:51:26', 35.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6066, 28, 12, '2025-06-15 11:51:26', '2025-06-15 13:51:26', 48.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6067, 28, 11, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 63.16, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6068, 28, 10, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 41.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6069, 28, 9, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 36.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6070, 28, 8, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 59.05, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6071, 28, 7, '2025-06-15 13:51:26', '2025-06-15 15:51:26', 69.81, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6072, 28, 6, '2025-06-13 21:51:26', '2025-06-13 23:51:26', 75.03, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6073, 28, 5, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 77.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6074, 28, 4, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 72.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6075, 28, 3, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 59.04, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6076, 28, 2, '2025-06-18 01:51:26', '2025-06-18 03:51:26', 60.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6077, 28, 1, '2025-06-20 09:51:26', '2025-06-20 11:51:26', 41.19, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6078, 29, 12, '2025-06-18 23:51:26', '2025-06-19 01:51:26', 54.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6079, 29, 11, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 77.64, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6080, 29, 10, '2025-06-14 23:51:26', '2025-06-15 01:51:26', 40.75, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6081, 29, 9, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 75.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6082, 29, 8, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 75.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6083, 29, 7, '2025-06-17 13:51:26', '2025-06-17 15:51:26', 40.60, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6084, 29, 6, '2025-06-20 01:51:26', '2025-06-20 03:51:26', 44.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6085, 29, 5, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 78.79, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6086, 29, 4, '2025-06-19 21:51:26', '2025-06-19 23:51:26', 59.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6087, 29, 3, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 66.52, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6088, 29, 2, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 50.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6089, 29, 1, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 52.94, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6090, 30, 12, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 53.09, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6091, 30, 11, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 37.30, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6092, 30, 10, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 50.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6093, 30, 9, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 43.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6094, 30, 8, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 63.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6095, 30, 7, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 42.93, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6096, 30, 6, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 65.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6097, 30, 5, '2025-06-18 05:51:26', '2025-06-18 07:51:26', 47.49, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6098, 30, 4, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 43.19, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6099, 30, 3, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 78.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6100, 30, 2, '2025-06-18 11:51:26', '2025-06-18 13:51:26', 61.53, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6101, 30, 1, '2025-06-19 15:51:26', '2025-06-19 17:51:26', 60.49, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6102, 31, 12, '2025-06-15 05:51:26', '2025-06-15 07:51:26', 55.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6103, 31, 11, '2025-06-17 17:51:26', '2025-06-17 19:51:26', 61.23, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6104, 31, 10, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 78.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6105, 31, 9, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 36.15, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6106, 31, 8, '2025-06-20 11:51:26', '2025-06-20 13:51:26', 72.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6107, 31, 7, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 59.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6108, 31, 6, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 72.07, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6109, 31, 5, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 69.95, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6110, 31, 4, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 50.48, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6111, 31, 3, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 59.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6112, 31, 2, '2025-06-17 15:51:26', '2025-06-17 17:51:26', 45.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6113, 31, 1, '2025-06-16 17:51:26', '2025-06-16 19:51:26', 58.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6114, 32, 12, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 65.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6115, 32, 11, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 51.34, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6116, 32, 10, '2025-06-18 23:51:26', '2025-06-19 01:51:26', 68.49, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6117, 32, 9, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 74.25, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6118, 32, 8, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 74.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6119, 32, 7, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 69.42, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6120, 32, 6, '2025-06-17 17:51:26', '2025-06-17 19:51:26', 64.91, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6121, 32, 5, '2025-06-17 09:51:26', '2025-06-17 11:51:26', 68.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6122, 32, 4, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 40.12, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6123, 32, 3, '2025-06-16 03:51:26', '2025-06-16 05:51:26', 56.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6124, 32, 2, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 44.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6125, 32, 1, '2025-06-13 21:51:26', '2025-06-13 23:51:26', 60.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6126, 33, 12, '2025-06-18 19:51:26', '2025-06-18 21:51:26', 35.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6127, 33, 11, '2025-06-19 09:51:26', '2025-06-19 11:51:26', 38.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6128, 33, 10, '2025-06-19 21:51:26', '2025-06-19 23:51:26', 46.78, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6129, 33, 9, '2025-06-17 23:51:26', '2025-06-18 01:51:26', 49.70, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6130, 33, 8, '2025-06-18 23:51:26', '2025-06-19 01:51:26', 73.32, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6131, 33, 7, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 45.73, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6132, 33, 6, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 74.05, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6133, 33, 5, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 50.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6134, 33, 4, '2025-06-17 09:51:26', '2025-06-17 11:51:26', 65.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6135, 33, 3, '2025-06-19 05:51:26', '2025-06-19 07:51:26', 78.23, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6136, 33, 2, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 38.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6137, 33, 1, '2025-06-14 23:51:26', '2025-06-15 01:51:26', 70.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6138, 34, 12, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 44.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6139, 34, 11, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 72.52, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6140, 34, 10, '2025-06-19 21:51:26', '2025-06-19 23:51:26', 35.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6141, 34, 9, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 59.86, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6142, 34, 8, '2025-06-19 09:51:26', '2025-06-19 11:51:26', 56.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6143, 34, 7, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 78.98, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6144, 34, 6, '2025-06-15 09:51:26', '2025-06-15 11:51:26', 49.83, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6145, 34, 5, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 55.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6146, 34, 4, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 74.06, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6147, 34, 3, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 48.86, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6148, 34, 2, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 36.74, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6149, 34, 1, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 78.40, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6150, 35, 12, '2025-06-19 01:51:26', '2025-06-19 03:51:26', 78.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6151, 35, 11, '2025-06-17 13:51:26', '2025-06-17 15:51:26', 74.53, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6152, 35, 10, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 75.52, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6153, 35, 9, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 44.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6154, 35, 8, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 68.28, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6155, 35, 7, '2025-06-14 05:51:26', '2025-06-14 07:51:26', 45.31, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6156, 35, 6, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 66.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6157, 35, 5, '2025-06-19 15:51:26', '2025-06-19 17:51:26', 44.00, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6158, 35, 4, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 58.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6159, 35, 3, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 35.61, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6160, 35, 2, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 62.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6161, 35, 1, '2025-06-18 05:51:26', '2025-06-18 07:51:26', 56.01, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6162, 36, 12, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 52.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6163, 36, 11, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 37.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6164, 36, 10, '2025-06-18 15:51:26', '2025-06-18 17:51:26', 56.75, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6165, 36, 9, '2025-06-15 07:51:26', '2025-06-15 09:51:26', 68.64, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6166, 36, 8, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 73.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6167, 36, 7, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 55.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6168, 36, 6, '2025-06-18 13:51:26', '2025-06-18 15:51:26', 42.32, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6169, 36, 5, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 75.86, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6170, 36, 4, '2025-06-17 03:51:26', '2025-06-17 05:51:26', 70.48, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6171, 36, 3, '2025-06-16 15:51:26', '2025-06-16 17:51:26', 71.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6172, 36, 2, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 45.97, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6173, 36, 1, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 51.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6174, 37, 12, '2025-06-19 01:51:26', '2025-06-19 03:51:26', 70.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6175, 37, 11, '2025-06-17 19:51:26', '2025-06-17 21:51:26', 64.55, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6176, 37, 10, '2025-06-16 21:51:26', '2025-06-16 23:51:26', 52.46, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6177, 37, 9, '2025-06-17 07:51:26', '2025-06-17 09:51:26', 55.78, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6178, 37, 8, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 47.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6179, 37, 7, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 43.79, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6180, 37, 6, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 42.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6181, 37, 5, '2025-06-19 07:51:26', '2025-06-19 09:51:26', 60.73, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6182, 37, 4, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 47.89, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6183, 37, 3, '2025-06-15 05:51:26', '2025-06-15 07:51:26', 48.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6184, 37, 2, '2025-06-19 03:51:26', '2025-06-19 05:51:26', 38.36, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6185, 37, 1, '2025-06-20 13:51:26', '2025-06-20 15:51:26', 68.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6186, 38, 12, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 53.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6187, 38, 11, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 48.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6188, 38, 10, '2025-06-18 17:51:26', '2025-06-18 19:51:26', 69.69, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6189, 38, 9, '2025-06-18 07:51:26', '2025-06-18 09:51:26', 35.94, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6190, 38, 8, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 55.64, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6191, 38, 7, '2025-06-20 11:51:26', '2025-06-20 13:51:26', 58.63, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6192, 38, 6, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 73.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6193, 38, 5, '2025-06-14 21:51:26', '2025-06-14 23:51:26', 52.62, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6194, 38, 4, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 71.20, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6195, 38, 3, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 69.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6196, 38, 2, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 43.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6197, 38, 1, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 67.30, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6198, 39, 12, '2025-06-16 13:51:26', '2025-06-16 15:51:26', 78.03, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6199, 39, 11, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 66.93, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6200, 39, 10, '2025-06-13 15:51:26', '2025-06-13 17:51:26', 74.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6201, 39, 9, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 46.43, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6202, 39, 8, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 77.48, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6203, 39, 7, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 64.31, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6204, 39, 6, '2025-06-16 03:51:26', '2025-06-16 05:51:26', 74.57, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6205, 39, 5, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 73.09, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6206, 39, 4, '2025-06-15 23:51:26', '2025-06-16 01:51:26', 42.50, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6207, 39, 3, '2025-06-19 05:51:26', '2025-06-19 07:51:26', 59.65, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6208, 39, 2, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 75.85, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6209, 39, 1, '2025-06-17 21:51:26', '2025-06-17 23:51:26', 49.31, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6210, 40, 12, '2025-06-18 23:51:26', '2025-06-19 01:51:26', 74.17, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6211, 40, 11, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 65.39, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6212, 40, 10, '2025-06-15 01:51:26', '2025-06-15 03:51:26', 79.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6213, 40, 9, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 75.71, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6214, 40, 8, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 43.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6215, 40, 7, '2025-06-19 09:51:26', '2025-06-19 11:51:26', 60.27, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6216, 40, 6, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 76.18, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6217, 40, 5, '2025-06-17 21:51:26', '2025-06-17 23:51:26', 50.05, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6218, 40, 4, '2025-06-19 09:51:26', '2025-06-19 11:51:26', 40.33, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6219, 40, 3, '2025-06-14 11:51:26', '2025-06-14 13:51:26', 45.88, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6220, 40, 2, '2025-06-19 13:51:26', '2025-06-19 15:51:26', 58.70, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6221, 40, 1, '2025-06-14 03:51:26', '2025-06-14 05:51:26', 72.37, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6222, 41, 12, '2025-06-19 23:51:26', '2025-06-20 01:51:26', 36.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6223, 41, 11, '2025-06-16 21:51:26', '2025-06-16 23:51:26', 45.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6224, 41, 10, '2025-06-18 21:51:26', '2025-06-18 23:51:26', 37.71, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6225, 41, 9, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 37.83, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6226, 41, 8, '2025-06-14 19:51:26', '2025-06-14 21:51:26', 64.45, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6227, 41, 7, '2025-06-18 23:51:26', '2025-06-19 01:51:26', 74.10, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6228, 41, 6, '2025-06-13 21:51:26', '2025-06-13 23:51:26', 62.89, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6229, 41, 5, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 77.95, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6230, 41, 4, '2025-06-19 19:51:26', '2025-06-19 21:51:26', 60.12, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6231, 41, 3, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 35.70, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6232, 41, 2, '2025-06-18 05:51:26', '2025-06-18 07:51:26', 47.21, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6233, 41, 1, '2025-06-16 03:51:26', '2025-06-16 05:51:26', 35.70, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6234, 42, 12, '2025-06-20 11:51:26', '2025-06-20 13:51:26', 73.43, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6235, 42, 11, '2025-06-15 21:51:26', '2025-06-15 23:51:26', 38.81, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6236, 42, 10, '2025-06-16 15:51:26', '2025-06-16 17:51:26', 76.62, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6237, 42, 9, '2025-06-15 19:51:26', '2025-06-15 21:51:26', 71.41, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6238, 42, 8, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 37.22, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6239, 42, 7, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 64.44, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6240, 42, 6, '2025-06-16 07:51:26', '2025-06-16 09:51:26', 79.36, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6241, 42, 5, '2025-06-18 21:51:26', '2025-06-18 23:51:26', 72.95, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6242, 42, 4, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 41.87, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6243, 42, 3, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 48.90, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6244, 42, 2, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 57.37, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6245, 42, 1, '2025-06-16 15:51:26', '2025-06-16 17:51:26', 64.86, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6246, 43, 12, '2025-06-13 19:51:26', '2025-06-13 21:51:26', 41.02, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6247, 43, 11, '2025-06-17 17:51:26', '2025-06-17 19:51:26', 60.62, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6248, 43, 10, '2025-06-14 01:51:26', '2025-06-14 03:51:26', 62.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6249, 43, 9, '2025-06-19 17:51:26', '2025-06-19 19:51:26', 58.14, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6250, 43, 8, '2025-06-20 07:51:26', '2025-06-20 09:51:26', 46.61, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6251, 43, 7, '2025-06-16 11:51:26', '2025-06-16 13:51:26', 47.35, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6252, 43, 6, '2025-06-14 15:51:26', '2025-06-14 17:51:26', 75.13, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6253, 43, 5, '2025-06-13 19:51:26', '2025-06-13 21:51:26', 56.40, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6254, 43, 4, '2025-06-15 15:51:26', '2025-06-15 17:51:26', 35.42, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6255, 43, 3, '2025-06-14 21:51:26', '2025-06-14 23:51:26', 75.32, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6256, 43, 2, '2025-06-20 01:51:26', '2025-06-20 03:51:26', 77.40, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6257, 43, 1, '2025-06-20 03:51:26', '2025-06-20 05:51:26', 72.77, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6258, 44, 12, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 55.96, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6259, 44, 11, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 48.24, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6260, 44, 10, '2025-06-13 23:51:26', '2025-06-14 01:51:26', 53.05, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6261, 44, 9, '2025-06-19 11:51:26', '2025-06-19 13:51:26', 78.67, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6262, 44, 8, '2025-06-16 01:51:26', '2025-06-16 03:51:26', 72.30, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6263, 44, 7, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 35.61, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6264, 44, 6, '2025-06-18 23:51:26', '2025-06-19 01:51:26', 70.84, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6265, 44, 5, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 35.48, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6266, 44, 4, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 36.56, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6267, 44, 3, '2025-06-14 13:51:26', '2025-06-14 15:51:26', 60.34, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6268, 44, 2, '2025-06-16 11:51:26', '2025-06-16 13:51:26', 52.34, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6269, 44, 1, '2025-06-18 09:51:26', '2025-06-18 11:51:26', 46.38, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6270, 45, 12, '2025-06-15 03:51:26', '2025-06-15 05:51:26', 50.22, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6271, 45, 11, '2025-06-13 19:51:26', '2025-06-13 21:51:26', 41.76, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6272, 45, 10, '2025-06-18 03:51:26', '2025-06-18 05:51:26', 71.51, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6273, 45, 9, '2025-06-14 07:51:26', '2025-06-14 09:51:26', 37.82, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6274, 45, 8, '2025-06-13 17:51:26', '2025-06-13 19:51:26', 75.05, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6275, 45, 7, '2025-06-16 09:51:26', '2025-06-16 11:51:26', 50.54, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6276, 45, 6, '2025-06-17 05:51:26', '2025-06-17 07:51:26', 59.78, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6277, 45, 5, '2025-06-14 23:51:26', '2025-06-15 01:51:26', 50.94, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6278, 45, 4, '2025-06-14 19:51:26', '2025-06-14 21:51:26', 69.92, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6279, 45, 3, '2025-06-16 05:51:26', '2025-06-16 07:51:26', 59.91, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6280, 45, 2, '2025-06-18 01:51:26', '2025-06-18 03:51:26', 58.99, '2025-06-11 15:51:26', 1);
INSERT INTO `screening` VALUES (6281, 45, 1, '2025-06-18 19:51:26', '2025-06-18 21:51:26', 41.65, '2025-06-11 15:51:26', 1);

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户名',
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '加密密码',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '手机号',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '邮箱',
  `register_time` datetime NULL DEFAULT CURRENT_TIMESTAMP COMMENT '注册时间',
  `user_type` tinyint NULL DEFAULT NULL COMMENT '用户类型：0-普通用户，2-影院管理员， -1-被拉黑用户',
  `status` tinyint NULL DEFAULT 1 COMMENT '状态：0-禁用，1-正常',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `username`(`username` ASC) USING BTREE,
  UNIQUE INDEX `phone`(`phone` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, '小王', '123456', '666', '666', '2025-05-28 11:24:35', 0, 1);
INSERT INTO `user` VALUES (2, '小徐', '123456', '123', '123', '2025-05-28 11:25:18', 0, 1);
INSERT INTO `user` VALUES (3, '小唐', '123456', '000', '000', '2025-05-28 11:25:37', 2, 1);
INSERT INTO `user` VALUES (4, '小李', '987654', '111', '111', '2025-05-28 11:26:47', 0, 1);
INSERT INTO `user` VALUES (5, '小张', '123123', '222', '222', '2025-05-28 14:46:06', 0, 1);
INSERT INTO `user` VALUES (8, '小三', '123456', '123456', '132456', '2025-05-30 09:48:42', 2, 1);
INSERT INTO `user` VALUES (10, '小一', '123456', '1234567', '123456', '2025-05-30 09:50:43', 0, 1);
INSERT INTO `user` VALUES (11, '小二', '123456', '12345678', '123456', '2025-05-30 09:51:35', 0, 1);

SET FOREIGN_KEY_CHECKS = 1;
